app/controllers/api/v1/carts_controller.rb

      def show
        validate_cart_id

        cart = Cart.find(params[:cart_id])
---
SELECT  `carts`.* FROM `carts` WHERE `carts`.`id` = 1 LIMIT 1

      def checkout
        validate_cart_id

        cart = Cart.find(params[:cart_id])
---
SELECT  `carts`.* FROM `carts` WHERE `carts`.`id` = 1 LIMIT 1

      def create
        cart = Cart.create!
---
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2019-01-10 01:54:05', '2019-01-10 01:54:05')