app/controllers/api/v1/cart_items_controller.rb

SELECT  `carts`.* FROM `carts` WHERE `carts`.`id` = 1 LIMIT 1
---
      def create
        # ensures that all the required parameters are there and exist
        # in the database.
        validate_product_id
        validate_cart_id
        validate_item_quantity

        cart = Cart.find(params[:cart_id])

SELECT  `carts`.* FROM `carts` WHERE `carts`.`id` = 1 LIMIT 1
UPDATE `cart_items` SET `item_quantity` = 5, `updated_at` = '2019-01-12 03:18:42' WHERE `cart_items`.`id` = 4
---
      def update
        # ensures that all the required parameters are there and exist
        # in the database
        validate_product_id
        validate_cart_id
        validate_item_quantity

        cart = Cart.find(params[:cart_id])
        cart.update_cart_item(params[:product_id], params[:item_quantity])

SELECT  `cart_items`.* FROM `cart_items` WHERE `cart_items`.`product_id` = 2 AND `cart_items`.`cart_id` = 1 LIMIT 1
DELETE FROM `cart_items` WHERE `cart_items`.`id` = 6
---
      def destroy
        # ensures that all the required parameters are there and exist
        # in the database
        validate_product_id
        validate_cart_id
        validate_cart_item

        cart_item = CartItem.find_by!(product_id: params[:product_id],
                                      cart_id: params[:cart_id])
        cart_item.destroy!