app/controllers/api/v1/products_controller.rb

      def index
        products = Product.all
---
SELECT `products`.* FROM `products`

      def show
        validate_product_id

        product = Product.find(params[:product_id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1

      def in_stock
        products = Product.where('inventory_count > ?', 0)
---
SELECT `products`.* FROM `products` WHERE (inventory_count > 0)